[
    {
        "name": "CLASSIC",
        "desc": "น้ำหนักเบาและใช้งานได้หลากหลาย อาวุธเริ่มต้นสำหรับทุกคนก็ต้องคลาสสิกอยู่แล้ว",
        "type": "ปืนพก",
        "hover": [
            "การยิงปกติจะแม่นเมื่ออยู่นิ่ง และมาพร้อมกับโหมดเบิร์สสำหรับการเผชิญหน้าในระยะใกล้"
        ],
        "pict": "/project/g41playvalorant/img/gun/classic.png"
    },
    {
        "name": "SHORTY",
        "desc": "การยิงปกติจะแม่นเมื่ออยู่นิ่ง และมาพร้อมกับโหมดเบิร์สสำหรับการเผชิญหน้าในระยะใกล้",
        "type": "ปืนพก",
        "hover": [
            "ปืนลูกซองกระบอกสั้นและคล่องตัวที่เป็นอันตรายถึงชีวิตในระยะใกล้ แต่สามารถยิงได้แค่สองครั้งก่อนที่จะต้องรีโหลด เหมาะกับการใช้คู่กับอาวุธระยะไกล"
        ],
        "pict": "/project/g41playvalorant/img/gun/shorty.png"
    },
    {
        "name": "FRENZY",
        "desc": "ระยะใกล้ เหนี่ยวไกไว้ หากระยะไกล... ใช้อย่างอื่นเถอะ",
        "type": "ปืนพก",
        "hover": [
            "การยิงปกติจะแม่นเมื่ออยู่นิ่ง และมาพร้อมกับโหมดเบิร์สสำหรับการเผชิญหน้าในระยะใกล้"
        ],
        "pict": "/project/g41playvalorant/img/gun/frenzy.png"
    },
    {
        "name": "GHOST",
        "desc": "สลวย เงียบ และมีประสิทธิภาพในทุกระยะ",
        "type": "ปืนพก",
        "hover": [
            "Ghost มีความแม่นยำและมีแม็กกาซีนที่ใหญ่แม้คุณจะยิงพลาด การยิงระยะไกลจะต้องควบคุมอัตราการยิงให้ดี จงยิงรัว ๆ เมื่อคุณเห็นความขี้ขลาดตาขาวของศัตรู"
        ],
        "pict": "/project/g41playvalorant/img/gun/ghost.png"
    },
    {
        "name": "SHERIFF",
        "desc": "ปืนหกนัดสมัยใหม่สำหรับคนชอบเฮดช็อต",
        "type": "ปืนพก",
        "hover": [
            "บรรจุด้วยกระสุนหนักที่มีแรงถีบที่สูงมากและต้องมีจิตวิญญาณที่แท้จริงถึงจะชำนาญ",
            "ใช้ Sheriff ให้คล่อง แล้วศัตรูของคุณจะรู้ว่าพวกเขาได้สูญสิ้นความหวังในการอยู่รอดไปแล้ว"
        ],
        "pict": "/project/g41playvalorant/img/gun/sheriff.png"
    },
    {
        "name": "STINGER",
        "desc": "พวกเขาจะรู้ทันทีว่ามันจบแล้ว เมื่อ Stinger เริ่มยิงสาดใส่",
        "type": "ปืนกล",
        "hover": [
            "พวกเขาจะรู้ทันทีว่ามันจบแล้ว เมื่อโดน Stinger กราดใส่",
            "SMG นี้มีศักยภาพในระยะกลางถึงไกลมากกว่าปืนอื่นที่คล้ายกัน แต่อัตราการยิงและความคล่องตัวก็น้อยลง"
        ],
        "pict": "/project/g41playvalorant/img/gun/stinger.png"
    },
    {
        "name": "SPECTRE",
        "desc": "เมื่อมีข้อสงสัย Spectre คือเบอร์หนึ่งของคุณ",
        "type": "ปืนกล",
        "hover": [
            "SMG นี้มีศักยภาพในระยะกลางถึงไกลมากกว่าปืนอื่นที่คล้ายกัน แต่อัตราการยิงและความคล่องตัวก็น้อยลง",
            "อาวุธที่มีดีในทุกด้าน มีความสมดุลของความเสียหาย อัตราการยิง และความแม่นยำที่ดี ทั้งในระยะใกล้และกลาง"
        ],
        "pict": "/project/g41playvalorant/img/gun/spectre.png"
    },
    {
        "name": "BUCKY",
        "desc": "ไม่ว่าจะเป็นฝ่ายโจมตี หรือฝ่ายตั้งรับ คุณคือผู้ที่มีปืนลูกซองปั้มอยู่ในมือ",
        "type": "ปืนลูกซอง",
        "hover": [
            "หนักแต่เสถียร การยิงปกติของ Bucky เหมาะสำหรับเอาตัวรอดในมุมแคบหรือการบุกระยะประชิด โหมดการยิงเสริมจะจู่โจมศัตรูในระยะกลาง"
        ],
        "pict": "/project/g41playvalorant/img/gun/bucky.png"
    },
    {
        "name": "JUDGE",
        "desc": "ปืนลูกซองอัตโนมัติ ยิงไวและสร้างความเสียหายสูงอย่างต่อเนื่อง",
        "type": "ปืนลูกซอง",
        "hover": [
            "Judge นั้นจะเสถียรเมื่อยืนอยู่กับที่ แต่จะเล็งได้ยากเมื่อยิงรัวอย่างต่อเนื่อง",
            "การยิงปกติจะบดขยี้เป้าหมายในระยะใกล้ และคุณต้องนิ่งเพื่อจะจัดการอะไรก็ตามที่อยู่ระยะห่างเกินแขน"
        ],
        "pict": "/project/g41playvalorant/img/gun/judge.png"
    },
    {
        "name": "BULLDOG",
        "desc": "มันมีความสุขบางอย่างที่วัดออกมาได้เมื่อใช้ Bulldog จัดการศัตรู",
        "type": "ปืนไรเฟิล",
        "hover": [
            "สัตว์ร้ายที่ยิงได้ผลแน่นอนหากคุณมีโอกาสได้เลือกการยิงเอง โหมดการยิงเสริมทำให้คุณได้ ADS และละทิ้งความแม่นยำ เบิร์ส ให้แก่ใครก็ตามที่จะลองดีกับคุณในระยะกลางไปจนถึงระยะไกล"
        ],
        "pict": "/project/g41playvalorant/img/gun/bulldog.png"
    },
    {
        "name": "GUARDIAN",
        "desc": "ส่องประกายเมื่ออยู่ในมือของนักยิงที่สุขุม",
        "type": "ปืนไรเฟิล",
        "hover": [
            "ปืนไรเฟิลขึ้นชื่อสำหรับนักแม่นปืน หนักและมีความคล่องตัวน้อยเมื่อเทียบกับไรเฟิลอื่น ๆ แต่แม่นยำและทรงพลัง ไม่มีคนใดที่จะรอดจากการยิงในระยะกลางถึงไกล"
        ],
        "pict": "/project/g41playvalorant/img/gun/guardian.png"
    },
    {
        "name": "PHANTOM",
        "desc": "อาวุธที่มีความสมดุล ถูกสร้างขึ้นมาเพื่อการยิงอย่างต่อเนื่องและมั่นคง",
        "type": "ปืนไรเฟิล",
        "hover": [
            "ยิงแบบอัตโนมัติจัดเต็มเมื่อมีคนมาทดสอบคุณใกล้ ๆ หรือยิงเบิร์สแบบรัดกุมเพื่อทำให้ศัตรูทุกรายตะเกียกตะกาย ใช้งานได้ดีที่สุดเมื่อยืนอยู่กับที่"
        ],
        "pict": "/project/g41playvalorant/img/gun/phantom.png"
    },
    {
        "name": "VANDAL",
        "desc": "ทรงพลังและแม่นยำ รุนแรงเมื่อยิงแบบเบิร์ส",
        "type": "ปืนไรเฟิล",
        "hover": [
            "การยิงต่อเนื่องเป็นเวลานานจะทำให้มีเสถียรภาพที่น้อยลง แต่ Vandal จะยังคงสร้างความเสียหายมากต่อให้ยิงไปในระยะไกลก็ตาม และให้รางวัลแก่คนที่เน้นการยิงทีละนัดไปที่หัวของเป้าหมาย"
        ],
        "pict": "/project/g41playvalorant/img/gun/vandal.png"
    },
    {
        "name": "MARSHAL",
        "desc": "หาและยึดมุมไว้ หายใจเข้า แล้วพวกเขาจะเสียใจที่เลี้ยวมาที่มุมนั้น",
        "type": "ปืนสไนเปอร์",
        "hover": [
            "เป็นไรเฟิลคันโยก-แอ็คชั่นว่องไวและซูมได้ครั้งเดียวซึ่งสามารถจัดการศัตรูดื้อรั้นให้อยู่ได้ อัตราการยิงที่ต่ำแปลว่าคุณต้องยิงเป้าหมายให้โดนหรือทิ้งให้ตัวเองถูกเปิดโปงต่อการโจมตี"
        ],
        "pict": "/project/g41playvalorant/img/gun/marshal.png"
    },
    {
        "name": "OPERATOR",
        "desc": "ทำตัวสบาย ๆ แล้วคุณจะสามารถควบคุมพื้นที่ที่สำคัญได้",
        "type": "ปืนสไนเปอร์",
        "hover": [
            "ปืนไรเฟิลกระบอกเกลียวที่ดุดันมีซูมคู่พลังงานสูง ลดความคล่องตัวอย่างมากแต่ก็ยิงได้ทรงพลังขนาดที่สามารถทำลายล้างทีมได้ด้วยการยิงนัดเดียว"
        ],
        "pict": "/project/g41playvalorant/img/gun/operator.png"
    },
    {
        "name": "ARES",
        "desc": "อย่าเข้าในผิดเรื่องขนาดของมันว่ามันเทอะทะ",
        "type": "อาวุธหนัก",
        "hover": [
            "แม็กกาซีนอันใหญ่ของ Ares แปลว่ามันเด่นในด้านการยิงกดดันหรือการสร้างความเสียหายอย่างมากแก่กลุ่มที่กระจุกกันอยู่"
        ],
        "pict": "/project/g41playvalorant/img/gun/ares.png"
    },
    {
        "name": "ODIN",
        "desc": "การควงเครื่องสังหารนี้จะมอบความรุ่งโรจน์แก่ผู้ถือและมอบความพินาศให้แก่ศัตรู",
        "type": "อาวุธหนัก",
        "hover": [
            "เด่นในด้านการยิงกดดัน สร้างความเสียหายอย่างหนักและมาพร้อมกับเสถียรภาพที่น่าประหลาดใจ สาดใส่ศัตรูในระยะใกล้และใช้โหมดการยิงเสริมเพื่อทำให้ตัวเองกลายเป็นป้อมปืนที่มีชีวิต"
        ],
        "pict": "/project/g41playvalorant/img/gun/odin.png"
    },
    {
        "name": "TACTICAL KNIFE",
        "desc": "การแก้ปัญหาที่ทุกคนคุ้นเคย",
        "type": "อาวุธระยะประชิด",
        "hover": [
            "เมื่ออยู่ในสถานการณ์คับขันหรือกระสุนหมด จงใช้สิ่งนี้จู่โจม ทำให้คุณวิ่งเร็ว ทำลายสิ่งของเร็วขึ้น หรือโจมตีศัตรูจากด้านหลังแบบทีเดียวตายด้วยโหมดการยิงเสริม"
        ],
        "pict": "/project/g41playvalorant/img/gun/tactical-knife.png"
    }
]
