import { Footer, Head, NavBar, Title } from '../components'
import styled from 'styled-components'
import { Card } from '../components/NewsComponents'
import Slider from 'react-slick'
import Data from '../public/news_content/contents.json'
const Item = styled(Slider)`


`
const Banner = styled.div`
    height: 71vh;
    width: 100%;
    background: url('/project/g41playvalorant/img/community-code-banner.jpeg') no-repeat center;
    background-size: cover;
`

const ContentSection = styled.div`
    background: #ece8e1;
    padding: 5vw 15vw;
    position: relative;
`

const Wraptextgrey = styled.div`
    color: #768079;
    line-height: 1.5;
`
const Wraptextblack = styled.div`
    color:#0f1923;
    line-height: 1.25;
    font-size: 25px;
`
const Movetext = styled.div`
    margin-left: 14vw;
`
const Blodtext = styled.div`
        color:#0f1923;
        font-size: 30px;
        font-weight: 600;
`
const Blodtext2 = styled.div`
        color:#0f1923;
        font-size: 30px;
        font-weight: 600;
        margin-top: 5vh;
`

const SLickStyle = styled(Slider)`
    .slick-list {
        overflow: ${(props) => (props.overflow ? "visible" : "hidden")};
    }
    .slick-slide{
        float: left;
        z-index: 0;
        user-select: none;
    }
    .slick-track .slick-active{
        filter: brightness(70%)
    }

    .slick-dots{
        position: absolute;
        left: -250px;
        top: 50px;
        width: 200px;
        height: 6px !important;
        display: flex;
        list-style-type: none;

    }
    .dot-custom{
        width: 40px;
        height: 6px;
        margin-right: 10px;
        position: relative;
        background: none;
        border: .1px solid white;
        cursor: pointer;
        transition: .5s;
    }
    .slick-dots .slick-active{
        width: 40px;
        height: 100%;
        margin-right: 10px;
    }
    .slick-active .dot-custom, .dot-custom:hover{
        background: #ff4655;
        border:  1px solid #ff4655;
    }
`
const SliderContainer = styled.div`
    width: 100%;
    height: 100%;
    z-index: 1;
`
const About = styled.div`
    background: #ece8e1;
    height: 100%;
    margin-left:auto;
    font-weight: 600;
    font-size: 15px;
    margin:4px;

`

const TextDot = styled.span`
    position: relative;
    margin-left: 2rem;
    color: #ff4655;
    &::before {
        content: "";
        width: 5px;
        height: 5px;
        border-radius: 50%;
        background: black;
        position: absolute;
        top: 40%;
        left: -40%;
    }
`

const RightWrapper = styled.div`
    position: absolute;
    right: 10vw;
    top: 20vh;
    height: 80%;
`

const StyledSocialIcon = styled.svg`
    fill: #ff4655;
    cursor: pointer;
    transition: all .15s linear;

    &:hover {
        fill: #141e37;
    }
`

const RotateText = styled.p`
    transform: rotate(90deg);
`

const StickyWrapper = styled.div`
    display: flex;
    flex-direction: column;
    font-weight: 600;
    font-size: 15px;
    row-gap: 1rem;
    top: 20vh;
    position: sticky;
`

const CommunityCode = () => {
    let settings = {
        dots: true,
        infinite: false,
        arrows: false,
        speed: 500,
        slidesToShow: 4,
        slidesToScroll: 1,
        appendDots: dots => <ul>{dots}</ul>,
        customPaging: i => (
            <div className="dot-custom">
            </div>
        )
    };
    return (
        <>
            <Head title="ระเบียบชุมชนของ VALORANT" />
            <NavBar />
            <Banner></Banner>
            <ContentSection>
                <RightWrapper>
                    <StickyWrapper>
                        <RotateText>แชร์:</RotateText>
                        <StyledSocialIcon viewBox="0 0 100 100">
                            <path d="M39.62 100V54H24.87c-.75 0-.75 0-.75-.5V37c0-.5.25-.5.75-.5h14.75V22.25a24.75 24.75 0 012.25-10.5A19.54 19.54 0 0152.12 2a22.75 22.75 0 019.76-2c3.75 0 7.75.25 11.5.25.74 0 1.5.25 2 .25s.51.25.51.5v14.75c0 .5-.25.5-.51.5h-8.76a21.88 21.88 0 00-4 .5 5.56 5.56 0 00-4.49 4.75 11.72 11.72 0 00-.26 3V36h16.75c.75 0 .75 0 .5.75-.5 3-.74 5.75-1.25 8.75a72.14 72.14 0 01-1 7.25c0 1 0 1-1 1H57.63V100z" />
                        </StyledSocialIcon>
                        <StyledSocialIcon viewBox="0 0 100 100">
                            <path d="M31.41 90.66c37.74 0 58.39-31.3 58.39-58.39v-2.64A41.79 41.79 0 00100 19a41.57 41.57 0 01-11.8 3.24 20.62 20.62 0 009-11.37 40.55 40.55 0 01-13 5 20.52 20.52 0 00-35.49 14 22.67 22.67 0 00.52 4.68A58.29 58.29 0 016.92 13.11a20.6 20.6 0 006.37 27.41A20.75 20.75 0 014 38v.28a20.55 20.55 0 0016.45 20.08 20 20 0 01-5.4.72 20.27 20.27 0 01-3.85-.36A20.53 20.53 0 0030.37 73a41.15 41.15 0 01-25.49 8.8A39.47 39.47 0 010 81.49a58.39 58.39 0 0031.41 9.17" />
                        </StyledSocialIcon>
                        <StyledSocialIcon viewBox="0 0 24 24">
                            <path d="M14.238 15.348a.215.215 0 010 .306c-.465.462-1.194.687-2.231.687l-.008-.002-.008.002c-1.036 0-1.766-.225-2.231-.688a.214.214 0 010-.305.219.219 0 01.307 0c.379.377 1.008.561 1.924.561l.008.002.008-.002c.915 0 1.544-.184 1.924-.561a.219.219 0 01.307 0zm-3.44-2.418a.922.922 0 00-1.845 0c0 .506.414.918.923.918a.92.92 0 00.922-.918zM24 12c0 6.627-5.373 12-12 12S0 18.627 0 12 5.373 0 12 0s12 5.373 12 12zm-5-.129a1.548 1.548 0 00-2.624-1.108c-1.056-.695-2.485-1.137-4.066-1.194l.865-2.724 2.343.549-.003.034c0 .696.569 1.262 1.268 1.262.699 0 1.267-.566 1.267-1.262a1.266 1.266 0 00-2.446-.458l-2.525-.592a.216.216 0 00-.257.145l-.965 3.038c-1.656.02-3.155.466-4.258 1.181A1.546 1.546 0 005 11.871c0 .566.311 1.056.768 1.325-.03.164-.05.331-.05.5 0 2.281 2.805 4.137 6.253 4.137s6.253-1.856 6.253-4.137c0-.16-.017-.317-.044-.472.486-.261.82-.766.82-1.353zm-4.872.141a.921.921 0 00-.922.919.921.921 0 001.844 0 .921.921 0 00-.922-.919z" />
                        </StyledSocialIcon>
                        <StyledSocialIcon viewBox="0 0 50.438 49.94">
                            <path d="M28.269 25.04a6.8 6.8 0 00-5.91-3.71h-.14a6.734 6.734 0 00-4.689 1.89l-9.552 9.17a6.754 6.754 0 00-.192 9.56 6.79 6.79 0 009.576.2s3.266-3.08 4.692-4.51c3.013 1.07 7.777.72 7.777.72l-8.376 8.04a12.674 12.674 0 11-17.57-18.27l9.552-9.17a12.688 12.688 0 0117.929.36 12.539 12.539 0 011.259 1.53zm-6.12-.16a6.777 6.777 0 005.91 3.7.646.646 0 00.139.01 6.731 6.731 0 004.688-1.89l9.553-9.17a6.77 6.77 0 10-9.384-9.76s-3.266 3.08-4.693 4.5c-3.013-1.07-7.776-.72-7.776-.72l8.375-8.04a12.674 12.674 0 1117.571 18.27l-9.553 9.17a12.675 12.675 0 01-17.928-.35 13.244 13.244 0 01-1.259-1.53z" fillRule="evenodd" />
                        </StyledSocialIcon>
                    </StickyWrapper>
                </RightWrapper>
                <p>02/06/63 <TextDot>ประกาศ</TextDot></p>
                <Title>ระเบียบชุมชนของ VALORANT</Title>
                <Movetext>
                    <Blodtext2>ระเบียบชุมชนของ </Blodtext2>
                    <Blodtext>VALORANT</Blodtext>
                    <Wraptextgrey>
                        <p>สิ่งนี้เริ่มได้จากตัวคุณ</p>
                        <p>เราอยากขอให้ผู้เล่นยอมรับกับสิ่งต่างๆ ที่พวกเราต้องขอความร่วมมือจากทุกคนก่อนที่จะเข้าคิวเพื่อเริ่มการแข่งขันแรก ซึ่งมีรายการดังต่อไปนี้ เราขอแนะนำให้ทุกคนอ่านเอกสารฉบับนี้จนจบและหวังว่าสิ่งนี้จะช่วยให้คุณปรับตัวให้เข้ากับชุมชนที่เราต้องการที่จะสร้างร่วมกันใน VALORANT ได้ดียิ่งขึ้น โปรดทราบว่าระเบียบวินัยสำหรับ VALORANT นี้เป็นส่วนเสริมของเงื่อนไขการให้บริการของ Riot Games ซึ่งคุณต้องยอมรับก่อนที่จะได้รับอนุญาตให้เข้าร่วมในเกมของเรา</p>
                        <Blodtext>ค่านิยม</Blodtext>
                        <Wraptextblack>ชนะด้วยการทำงานเป็นทีม</Wraptextblack>
                        <p>ประสบการณ์ที่ดีที่สุดใน VALORANT มาจากการทำงานเป็นทีม เราเชื่อว่าการประสานงานกับเพื่อนร่วมทีมเป็นส่วนหนึ่งของทักษะการแสดงออกของแต่ละบุคคล และทุกคนจะเล่นได้ดีที่สุดเมื่อพวกเขาเล่นด้วยกัน   เราฉลองให้เพื่อนร่วมทีมที่คว้าชัยชนะในแต่ละรอบและเราก็รู้ว่าช่วงเวลาเหล่านั้นจะมีค่าที่สุดเมื่อพวกคุณได้ทำงานร่วมกัน ช่วยเหลือซึ่งกันและกัน ในทุกๆ รอบ เราตั้งใจที่จะมอบประสบการณ์ เครื่องมือ และเนื้อหาที่จะช่วยให้แต่ละทีมสามารถเล่นด้วยกันได้อย่างเต็มความสามารถ ไม่ว่าพวกเขาจะเล่นด้วยกันห้ารอบหรือห้าร้อยรอบกว่าจะทำความรู้จักกันได้</p>
                        <Wraptextblack>ความยุติธรรมในทุกการแข่งขัน</Wraptextblack>
                        <p>เงื่อนไขสำหรับการแข่งขันนั้นจะต้องยุติธรรมสำหรับผู้เล่นทุกคนเพื่อให้การแข่งขันทุกครั้งมีความหมาย เราเชื่อว่าความยุติธรรมหมายถึงเกมที่ปราศจากการโกง การใช้ระบบเกมในทางที่ผิด และการคุกคามในทุกรูปแบบ</p>
                        <p>เรามุ่งมั่นที่จะรักษาความมั่นคงของการแข่งขันและจะทำทุกอย่างเพื่อให้แน่ใจว่าผู้เล่นทุกคนได้รับการปฏิบัติด้วยความเคารพภายใต้ระบบการแข่งขันของเรา เมื่อพูดถึงพฤติกรรมที่ก่อกวนนั้น เราเชื่อว่าบทลงโทษควรสะท้อนถึงมาตรฐานและความต้องการของชุมชนและควรระบุถึงลักษณะเฉพาะของพฤติกรรมก่อกวนเหล่านั้นมากกว่าการเน้นไปที่เรื่องของบทลงโทษจนมากเกินไป</p>
                        <Wraptextblack>เกมที่ผู้เล่นจะได้เติบโตและก้าวหน้า</Wraptextblack>
                        <p>สิ่งนี้จะขึ้นอยู่กับเราที่จะตั้งเงื่อนไขสำหรับ VALORANT ที่จะช่วยให้ผู้เล่นทุกคนเล่นได้ดีที่สุด นั่นหมายถึงการทำให้ผู้เล่นรู้สึกมั่นใจในความปลอดภัย ความยุติธรรม และการกระทำผ่านประสบการณ์บนแพลตฟอร์มของเรา เรามุ่งมั่นที่จะมอบเครื่องมือต่างๆ ให้กับผู้เล่นที่ต้องการใช้เพื่อปกป้องตนเองและบัญชีของพวกเขา และเราเชื่อมั่นว่าพวกเขาจะใช้มันเพื่อดูแลประสบการณ์ในการเล่นของตนเอง</p>
                        <p>เราเชื่อในการให้ผู้เล่นควบคุมวิธีการที่พวกเขาจะโต้ตอบกับเพื่อนได้ และในการให้ทางเลือกที่มีความหมายสำหรับการใช้การควบคุมนั้น ทางเลือกที่จะไม่ทำให้ความสามารถในการแข่งขันและการประสานงานกับทีมของพวกเขาลดลง แม้จะมีตัวเลือกหลายอย่าง เราก็ยังคงตั้งใจที่จะปกป้องสิทธิ์ของผู้เล่นทุกคนในการเลือกวิธีการประสานงาน และป้องกันไม่ให้ผู้เล่นต้องถูกบังคับให้ออกจากช่องแชทเนื่องจากความกลัว หรือเพราะพวกเขาโดนเหยียดหยามโดยผู้เล่นอื่น</p>
                        <Wraptextblack>ความคาดหวัง</Wraptextblack>
                        <p>ผู้เล่น VALORANT ทุกคนควรที่จะได้รับโอกาสในการเป็นตัวของตัวเองและเล่นให้ดีที่สุด คุณควรที่จะได้เล่นในแต่ละการแข่งขันโดยปราศจากการคุกคาม ความเกลียดชัง และการเหยียดหยาม เช่นเดียวกันกับเพื่อนร่วมทีมและคู่แข่งของคุณ</p>
                        <p>และเราจำเป็นต้องได้รับความช่วยเหลือจากคุณเพื่อสร้างเกมตามค่านิยมดังกล่าว เราทั้งขอและคาดหวังให้คุณยอมรับสิ่งต่อไปนี้เมื่อคุณเล่น VALORANT:</p>
                        <Wraptextblack>แข่งขันเพื่อคว้าชัยชนะไปด้วยกัน</Wraptextblack>
                        <p>การทำงานเป็นทีมจะนำมาซึ่งชัยชนะ โปรดจำไว้ว่าคุณชนะได้เพราะมีเพื่อนร่วมทีม ไม่ใช่เพราะขาดพวกเขา</p>
                        <p>เช่น เราคาดหวังและส่งเสริมให้คุณ:</p>
                        <p>✅ ให้ความสนใจกับกลยุทธ์ หากพวกคุณตกลงกันไม่ได้ ให้เลือกอะไรซักอย่างแล้วทำให้เต็มที่ การร่วมมือกันในแผนการที่ชวนให้ตั้งคำถามก็ยังดีกว่าไม่ได้ทำงานร่วมกันเลย</p>
                        <p>✅ ใช้ประโยชน์จากจุดแข็งของทีมและช่วยกันแก้ไขจุดอ่อนของพวกเขา พวกเขาก็จะช่วยคุณด้วยเช่นกัน!</p>
                        <p>✅ ยินดีไปกับการเล่นของเพื่อนร่วมทีม สนับสนุนพวกเขาอยู่เสมอเพื่อช่วยให้พวกเขาเฉิดฉายในช่วงเวลาสำคัญ</p>
                        <p>✅ นำตัวตนที่ดีที่สุดของคุณเข้าสู่การแข่งขันในทุกครั้ง มีบ้างในบางครั้งที่เราอาจเล่นได้ไม่ดี มันเกิดขึ้นกับทุกคน เรื่องนั้นเราเข้าใจ! แต่หากคุณไม่ได้ตั้งใจที่จะมาเพื่อคว้าชนะก็ไม่ต้องเข้าคิวจับคู่แข่งขัน</p>
                        <p>✖ อย่าถอดใจหรือยอมแพ้กับเพื่อนร่วมทีมแม้ว่าพวกเขาจะเล่นได้ไม่ดีเท่าไหร่นักก็ตาม</p>
                        <p>✖ อย่าทำร้ายทีมของคุณเองหรือพยายามทำลายการแข่งขันแม้ว่าคุณอาจจะรู้สึกไม่สนุกไปกับมันแล้วก็ตาม</p>
                        <p>✖ โปรดอย่าบอกเพื่อนร่วมทีมว่าควรเล่นอย่างไร หากพวกเขาเปิดใจรับความคิดเห็นที่สร้างสรรค์ก็ถือว่าดีเยี่ยม! แต่อย่าออกคำสั่งกับคนอื่นไปทั่ว แม้ว่าคุณจะหงุดหงิดก็ตาม</p>
                        <p>✖ หลีกเลี่ยงการใช้เวลาในการโต้แย้งกันมากกว่าเวลาที่ร่วมมือกัน หากคุณสิ้นชีพในรอบนั้นแล้ว โปรดมุ่งเน้นไปที่การช่วยเหลือเพื่อให้ทีมของคุณได้จบการแข่งขันอย่างเข้มแข็งมากกว่าที่จะถกเถียงกันในขณะที่พวกเขากำลังจะจบการแข่งขันในรอบนั้น</p>
                        <Wraptextblack>ให้ความสำคัญกับความเคารพและความเอาใจใส่</Wraptextblack>
                        <p>เราขอให้คุณปฏิบัติต่อผู้อื่นด้วยความเคารพและให้เกียรติซึ่งกันและกัน โปรดเอาใจใส่และพยายามสร้างความไว้วางใจกับเพื่อนร่วมทีมเพื่อให้พวกเขาสามารถเล่นได้ดีที่สุด</p>
                        <p>เช่น เราคาดหวังและส่งเสริมให้คุณ:</p>
                        <p>✅ ปฏิบัติตามกฎที่สำคัญ - ปฏิบัติต่อผู้อื่นอย่างที่พวกเขาต้องการ หากคุณไม่ทราบ ก็ถามพวกเขาได้เสมอ</p>
                        <p>✅ เคารพความแตกต่างและประสบการณ์ของแต่ละบุคคล เพราะ VALORANT คือชุมชนระดับโลก</p>
                        <p>✅ ปฏิบัติต่อทุกคนให้เหมือนกับว่าพวกเขาสามารถสอนบางสิ่งบางอย่างให้กับคุณหรือพวกเขาอาจขยายโลกทัศน์ของคุณได้</p>
                        <p>✅ ใช้ภาษาด้วยความระมัดระวัง อย่าคิดว่าทุกคนจะเข้าใจความหมายหรือเจตนาของคุณโดยเฉพาะในกรณีที่พวกคุณเพิ่งพบกัน หากมีคนขอให้คุณเลิกใช้คำพูดใดคำพูดหนึ่ง ก็ขอให้หยุด - แม้ว่าคุณจะไม่คิดว่ามันเป็นคำที่ไม่เหมาะสมก็ตาม</p>
                        <p>✅ ช่องทางการสื่อสารเป็นพื้นที่ผู้เล่นทุกคนจะได้แบ่งปันกัน! ใช้การสื่อสารมุ่งเน้นไปที่เรื่องของการประสานงาน แม้ว่าคุณจะกำลังรอเกิดใหม่ก็ตาม</p>
                        <p>✖ อย่าใช้ภาษาที่แสดงความเกลียดชังหรือดูหมิ่น เราจะไม่ยอมรับข้อความหรือความคิดเห็นที่คุกคามเพศสภาพ เชื้อชาติ รสนิยมทางเพศ อายุ ความสามารถทางจิตใจหรือร่างกาย ความผูกพันทางศาสนา หรือประเทศต้นกำเนิด</p>
                        <p>✖ อย่าสร้างมุกตลกเกี่ยวกับคนอื่น ผู้คนไม่ใช่มุกตลก</p>
                        <p>✖ การขู่เข็ญทุกชนิดนั้นไม่เป็นที่ยอมรับใน VALORANT เจตนาไม่ใช่สิ่งสำคัญที่นี่ และคุณจะต้องรู้จักผู้ฟังของคุณหากคุณคิดว่ามันเป็นเพียง “แค่เรื่องตลก” </p>
                        <p>✖ อย่าคาดหวังให้คนอื่น “อดทน” กับภาษาของคุณ หากคุณทำให้ใครบางคนอารมณ์เสีย จงยอมรับมันแล้วทำตัวให้ดีขึ้นในครั้งต่อไป เคารพขอบเขตของคนอื่น</p>
                        <p>✖ หลีกเลี่ยงการรบกวนช่องทางการสื่อสารด้วยเสียงพื้นหลัง เพลง หรือสแปม</p>
                        <Wraptextblack>ปกป้องทีมและชุมชนของคุณ</Wraptextblack>
                        <p>จงสร้างชุมชนที่คุณอยากมีส่วนร่วมในการเล่นทีละนิดในแต่ละรอบของเกม ใช้เครื่องมือและวิจารณญาณที่ดีเพื่อปกป้องตัวเองและเพื่อนร่วมงานของคุณ และสนับสนุนผู้อื่นเมื่อพวกเขาต้องการความช่วยเหลือจากคุณ</p>
                        <p>เช่น เราคาดหวังและส่งเสริมให้คุณ:</p>
                        <p>✅ ใช้การตั้งค่าและระบบเพื่อจัดการกับประสบการณ์ที่คุณอยากสัมผัส เลือกออกจากช่องทางการสื่อสารที่คุณไม่ต้องการเข้าร่วม เปิดใช้ตัวกรองภาษา ใช้การปิดเสียง และรายงานพฤติกรรมที่ไม่เหมาะสม</p>
                        <p>✅ หากมีใครคุกคามเพื่อนร่วมทีมของคุณ โปรดช่วยเหลือเขาหากคุณทำได้ ระวังอย่าทำให้สถานการณ์แย่ลงกว่าที่เป็นอยู่ แต่บางครั้งการสนับสนุนเล็กน้อยก็อาจมีความหมายกับเพื่อนร่วมทีมของคุณมาก</p>
                        <p>✅ ช่วยให้เกมปลอดจากการโกงหรือการใช้ประโยชน์จากข้อบกพร่องของเกม หากคุณคิดว่ามีใครบางคนที่ทำเช่นนั้นอยู่ โปรดรายงานให้เราทราบได้เลย</p>
                        <p>✖ อย่าเรียกร้องให้เกิดการรายงานเป็นจำนวนมากหรือดึงเพื่อนร่วมทีมมาร่วมโต้เถียงด้วย รายงานฉบับเดียวก็เพียงพอที่จะทำให้เราทราบว่ามีเรื่องบางอย่างเกิดขึ้น
                        </p>
                        <p>✖ อย่าปล่อยให้ใครดึงคุณลงไปอยู่ระดับเดียวกับพวกเขา หากคุณถูกคุกคามอยู่ มันจะเป็นการดีกว่าที่จะถอนตัวเองออกจากจุดนั้นแทนที่จะ “เอาคืน” การทะเลาะกันจำเป็นต้องใช้สองคนขึ้นไปถึงจะดำเนินต่อไปได้
                        </p>
                        <p>เป็นด่านป้องกันสุดท้ายของตัวคุณเอง
                        </p>
                        <p>ร่วมมือกับ Riot เพื่อป้องกันให้ตัวเองปลอดภัย มีความรับผิดชอบต่อบัญชี อุปกรณ์ ข้อมูลส่วนตัว และ ความประพฤติของคุณ
                        </p>
                        <p>เช่น เราคาดหวังและส่งเสริมให้คุณ:
                        </p>
                        <p>✅ ใช้รหัสผ่านที่คาดเดายากและเก็บอุปกรณ์ทั้งหมดของคุณให้ปลอดภัย คุณสามารถอ่านเพิ่มเติมเกี่ยวกับเรื่องนี้ได้ [ที่นี่]
                        </p>
                        <p>✅ หากคุณคิดว่าบัญชีของคุณถูกแฮ็ค โปรดแจ้งให้เราทราบโดยเร็วที่สุด [ลิงก์]
                        </p>
                        <p>✅ บัญชีแต่ละบัญชีจะมีผู้ใช้ได้สูงสุดเพียงหนึ่งคนเท่านั้น เราคาดหวังให้คุณรักษาบัญชีของคุณให้ปลอดภัยและไม่อนุญาตให้คนอื่นใช้งาน เล่นกับเพื่อนของคุณสิหากคุณต้องการไต่แรงค์ อย่าขอให้เพื่อนของคุณเล่นให้
                        </p>
                        <p>✅ เล่นด้วยความรับผิดชอบ ดูแลตนเองให้ดีเพื่อให้คุณสามารถเล่นในทุกเกมได้อย่างดีที่สุด
                        </p>

                        <p> ✖ ห้ามเรียกใช้โปรแกรมของบุคคลที่สามที่แทรกแซงการเล่นเกม เราคาดหวังให้คุณเล่นด้วยความระมัดระวังและใช้วิจารณญาณที่ดี</p>
                        <p>✖ อย่าแชร์ข้อมูลส่วนบุคคลกับคนแปลกหน้า นอกจากนี้อย่าแชร์ข้อมูลของคนอื่นด้วย เรามีนโยบายที่จะไม่ยอมรับต่อการเปิดเผยข้อมูลส่วนบุคคลบนแพลตฟอร์มของเรา</p>
                        <p>✖ อย่าปลอมตัวเป็นคนอื่น โดยเฉพาะอย่างยิ่งอย่าสวมบทบาทเป็นสมาชิก Riot หรือผู้เล่นที่มีชื่อเสียง </p><p>
                        </p>
                        <p>✖ หลีกเลี่ยงการเข้าคิวเพื่อเล่นอีกเกม หากคุณรู้ว่าคุณกำลังมือตก พักสมอง และจงรู้ตัวเองเมื่อคุณเริ่มรู้สึกหงุดหงิด</p>
                        <Wraptextblack>ผลที่ตามมา</Wraptextblack>
                        <p>หากคุณไม่ทำตามสิ่งที่เราได้ขอความร่วมมือกับคุณตามที่เราได้อธิบายเอาไว้ข้างต้น เราอาจจะจำกัดสิทธิ์บางอย่างของคุณหรือการเข้าถึงฟีเจอร์บางประเภทในเกมของเรา ข้อจำกัดนี้ใช้เพื่อป้องกันชุมชนจากความวุ่นวายที่อาจจะเกิดขึ้นในอนาคต และให้โอกาสกับผู้ใช้ในการได้ตรึกตรองถึงความประพฤติที่ไม่เหมาะสมที่เกิดขึ้น เรามุ่งมั่นที่จะมอบแนวทาง และโอกาสในการปรับปรุงตนให้กับผู้เล่น แต่จะต้องไม่แลกมาด้วยข้อจำกัดในการปกป้องชุมชนที่เหลือของเรา นอกจากนี้เรายังมุ่งมั่นที่จะจัดการกับความประพฤติที่ไม่เหมาะสมต่างๆ ตามผลกระทบที่มันได้สร้างกับผู้เล่นคนอื่นในเกมเพื่อหลีกเลี่ยงการมอบบทลงโทษที่รุนแรงโดยไม่จำเป็น
                        </p>
                        <p>บทลงโทษสำหรับการละเมิดข้อคำร้องขอดังกล่าวอาจรวมถึง (แต่อาจมีมากกว่านี้):
                        </p>
                        <p>● สูญเสียความสามารถในการใช้ระบบสื่อสารในเกม
                        </p>
                        <p>● เพิ่มข้อจำกัดหรือข้อกำหนดเพิ่มเติมเพื่อเข้าใช้งานระบบต่างๆ เช่น การเข้าคิวเพื่อเล่นในโหมดจัดอันดับ
                        </p>
                        <p>● จำกัดการเข้าถึงระบบและฟีเจอร์ของโซเชียลในทุกๆ เกมของ Riot
                        </p>
                        <p>● ลบไอเทมที่พบว่าได้มาอย่างไม่ถูกต้อง
                        </p>
                        <p>● ระงับสิทธิ์ในการเล่น VALORANT หรือเกมทั้งหมดของ Riot เป็นการชั่วคราวหรือถาวร
                        </p>


                    </Wraptextgrey>
                </Movetext>
                <About>
                    <h1>เนื้อหาที่เกี่ยวข้อง</h1>
                    <SLickStyle {...settings}>{Data.NEWS.map((newsitem, index) => {
                        return <Card data={newsitem} key={index} width="40%" height="40%">

                        </Card>
                    })}
                    </SLickStyle>

                </About>
            </ContentSection>

            <Footer />
        </>
    )
}


export default CommunityCode;
